[
  {
    "plan_name": "LIC Jeevan Umang",
    "plan_code": "945",
    "category": "whole_life",
    "content": "LIC Jeevan Umang (Plan Code: 945) is a whole life assurance plan. ELIGIBILITY: Minimum Entry Age is 90 days (3 months). Maximum Entry Age is 55 years. Policy Term is whole life (100 years minus age at entry). Premium Payment Terms available are 15, 20, 25 or 30 years. BENEFITS: Survival Benefit of 8% of Basic Sum Assured is payable at the end of each policy year after completion of premium payment term till maturity. Maturity Benefit equal to Basic Sum Assured is payable on maturity. Death Benefit is Sum Assured on Death which is higher of 125% of Basic Sum Assured or 7 times annualized premium. PREMIUM: Minimum Basic Sum Assured is Rs. 2,00,000. Maximum is unlimited. Premiums can be paid yearly, half-yearly, quarterly or monthly.",
    "source_url": "https://licindia.in/web/guest/whole-life-plans"
  },
  {
    "plan_name": "LIC New Endowment Plan",
    "plan_code": "914",
    "category": "endowment",
    "content": "LIC's New Endowment Plan (Plan Code: 914) is a participating endowment assurance plan. ELIGIBILITY: Minimum Entry Age is 8 years. Maximum Entry Age varies from 50 to 55 years depending on policy term. Policy Terms available are 12, 15, 20, 25, 30 and 35 years. BENEFITS: Maturity Benefit includes Sum Assured plus accrued bonuses (Simple Reversionary Bonuses and Final Additional Bonus). Death Benefit during premium payment term is Sum Assured plus accrued bonuses. Death Benefit after completion of premium payment is 125% of Sum Assured plus accrued bonuses. SURVIVAL BENEFITS: Endowment plans provide survival benefits during the policy term through bonuses and maturity benefits at the end of the term. TAX BENEFITS: Premiums paid qualify for deduction under Section 80C of Income Tax Act. Maturity proceeds are exempt under Section 10(10D) subject to conditions.",
    "source_url": "https://licindia.in/web/guest/endowment-plans"
  },
  {
    "plan_name": "LIC Jeevan Anand",
    "plan_code": "915",
    "category": "whole_life",
    "content": "LIC's New Jeevan Anand (Plan Code: 915) is a whole life plan with endowment benefit option. ELIGIBILITY: Minimum Entry Age is 18 years. Maximum Entry Age is 50 years. Policy Term ranges from 15 to 35 years. MATURITY BENEFITS: On survival till maturity, Sum Assured plus accrued bonuses (Simple Reversionary Bonuses and Final Additional Bonus) are payable. DEATH BENEFITS: On death during the policy term, Sum Assured plus accrued bonuses plus additional benefits are paid to the nominee. Death benefit includes Sum Assured plus accumulated bonuses.",
    "source_url": "https://licindia.in/web/guest/whole-life-plans"
  },
  {
    "plan_name": "LIC Jeevan Labh",
    "plan_code": "936",
    "category": "endowment",
    "content": "LIC's Jeevan Labh (Plan Code: 936) is a limited premium payment endowment plan. ELIGIBILITY: Minimum Entry Age varies by policy term - for 16 year term it is 8 years, for 21 year term it is 8 years, for 25 year term it is 8 years. Maximum Entry Age is 59 years. BENEFITS: Maturity benefit includes Sum Assured plus loyalty additions. Death benefit is Sum Assured plus accrued loyalty additions. Premium Payment Term is limited and less than Policy Term. MINIMUM SUM ASSURED: Rs. 2,00,000 with no maximum limit.",
    "source_url": "https://licindia.in/web/guest/endowment-plans"
  },
  {
    "plan_name": "LIC Tech Term",
    "plan_code": "854",
    "category": "term_assurance",
    "content": "LIC's Tech Term (Plan Code: 854) is a pure risk premium term assurance plan. ELIGIBILITY: Minimum Entry Age is 18 years. Maximum Entry Age is 65 years. Policy Terms available are 10 to 40 years. BENEFITS: Only death benefit is payable. No maturity or survival benefits. On death during policy term, Sum Assured is paid to nominee. DIFFERENCE FROM ENDOWMENT: Term assurance provides only death cover without any maturity benefit. Endowment plans provide both death cover and maturity benefits, hence premiums are higher for endowment plans. MINIMUM SUM ASSURED: Rs. 25,00,000 (Rs. 25 lakhs).",
    "source_url": "https://licindia.in/web/guest/term-assurance-plans"
  },
  {
    "plan_name": "LIC Jeevan Akshay VII",
    "plan_code": "857",
    "category": "pension",
    "content": "LIC's Jeevan Akshay VII (Plan Code: 857) is an immediate annuity plan. ELIGIBILITY: Minimum Entry Age is 30 years. Maximum Entry Age is 85 years. BENEFITS: Immediate annuity/pension starts from the date of purchase. Various annuity options available including life annuity, joint life annuity, and annuity with return of purchase price. No death benefit during annuity period in certain options.",
    "source_url": "https://licindia.in/web/guest/pension-plans"
  },
  {
    "plan_name": "LIC New Money Back Plan - 20 Years",
    "plan_code": "920",
    "category": "money_back",
    "content": "LIC's New Money Back Plan - 20 Years (Plan Code: 920) is a participating money back plan. ELIGIBILITY: Minimum Entry Age is 13 years. Maximum Entry Age is 50 years. Policy Term is 20 years. BENEFITS: Survival Benefits of 20% of Sum Assured payable at the end of 5th, 10th and 15th policy years. Maturity Benefit of 40% of Sum Assured plus accrued bonuses payable on maturity. Death Benefit is Sum Assured plus accrued bonuses. MONEY BACK EXPLANATION: Money back plans provide periodic survival benefits (liquidity) during the policy term along with death cover. Endowment plans provide higher maturity benefits as no periodic payments are made, making them better for long-term savings.",
    "source_url": "https://licindia.in/web/guest/money-back-plans"
  },
  {
    "plan_name": "LIC Single Premium Endowment Plan",
    "plan_code": "917",
    "category": "endowment",
    "content": "LIC's Single Premium Endowment Plan (Plan Code: 917) is a single premium participating endowment plan. ELIGIBILITY: Minimum Entry Age is 8 years. Maximum Entry Age is 55 years. Policy Terms available are 10, 12, 15, 18 and 20 years. BENEFITS: Maturity Benefit includes Sum Assured plus accrued bonuses. Death Benefit is Sum Assured plus accrued bonuses. PREMIUM: Single premium payment at inception. No further premiums required.",
    "source_url": "https://licindia.in/web/guest/endowment-plans"
  },
  {
    "plan_name": "LIC Types of Plans Overview",
    "plan_code": "OVERVIEW",
    "category": "general",
    "content": "LIC offers various types of insurance plans: 1. ENDOWMENT PLANS: Provide both death cover and maturity benefits with savings component. Examples: New Endowment Plan (914), Jeevan Labh (936). 2. WHOLE LIFE PLANS: Provide coverage for entire lifetime. Examples: Jeevan Umang (945), Jeevan Anand (915). 3. TERM ASSURANCE PLANS: Pure protection plans with only death benefit, no maturity benefit. Example: Tech Term (854). Maximum entry age typically 60-65 years. 4. MONEY BACK PLANS: Provide periodic survival benefits during policy term. Example: New Money Back Plan (920). 5. PENSION PLANS: Provide retirement income through annuities. Example: Jeevan Akshay VII (857). 6. HEALTH PLANS: Provide health insurance coverage. LIC offers different plans for different life stages and financial goals.",
    "source_url": "https://licindia.in/web/guest/products"
  },
  {
    "plan_name": "LIC Death Benefits and Claims",
    "plan_code": "CLAIMS",
    "category": "claims",
    "content": "DEATH BENEFITS: Yes, LIC provides death benefits to nominees. Death benefit typically includes Sum Assured plus accrued bonuses payable to the nominee. The nominee must submit death claim documents including death certificate, policy document, and discharge forms. Death claims are usually processed within 30 days of submission of complete documents. In case of death during premium payment term of an endowment plan, death benefit including sum assured and bonuses is paid to the nominee immediately, and no further premiums are required.",
    "source_url": "https://licindia.in/web/guest/customer-service"
  },
  {
    "plan_name": "LIC Medical Requirements",
    "plan_code": "MEDICAL",
    "category": "underwriting",
    "content": "MEDICAL REQUIREMENTS: Medical examination requirements for purchasing LIC policies depend on age of the proposer and sum assured. For lower sum assured and younger age groups, self-declaration of health may be sufficient. For higher sum assured (typically above Rs. 50 lakhs) or higher age groups (above 45-50 years), medical examination including blood tests, ECG, and other tests may be required as per LIC underwriting guidelines. Special medical tests may be required for certain occupations or health conditions.",
    "source_url": "https://licindia.in/web/guest/customer-service"
  },
  {
    "plan_name": "LIC Tax Benefits",
    "plan_code": "TAX",
    "category": "general",
    "content": "TAX BENEFITS ON LIC PLANS: Yes, LIC plans provide significant tax benefits. Premiums paid for LIC life insurance policies qualify for tax deduction under Section 80C of Income Tax Act up to Rs. 1,50,000 per annum. Maturity proceeds including sum assured and bonuses are exempt from income tax under Section 10(10D) of Income Tax Act subject to conditions. Death benefits received by nominees are also tax-free under Section 10(10D). However, tax laws are subject to change and policyholders should consult tax advisors.",
    "source_url": "https://licindia.in/web/guest/products"
  },
  {
    "plan_name": "LIC Minor as Policyholder",
    "plan_code": "MINOR",
    "category": "general",
    "content": "MINOR CHILD AS POLICYHOLDER: No, a minor child cannot be the policyholder of an LIC plan as minors cannot enter into legal contracts. However, minors can be the life assured (person whose life is insured) in LIC policies. In such cases, the parent or legal guardian must be the proposer/policyholder. The policy can be assigned to the child when they attain majority (18 years of age). LIC offers special plans for children's education and marriage needs.",
    "source_url": "https://licindia.in/web/guest/products"
  },
  {
    "plan_name": "LIC NRI Policies",
    "plan_code": "NRI",
    "category": "general",
    "content": "NRI ELIGIBILITY FOR LIC POLICIES: NRIs (Non-Resident Indians) can purchase LIC policies subject to certain conditions. NRI eligibility and purchase channels depend on residential status and specific plan requirements. NRIs can purchase policies online through LIC's e-services portal or through authorized agents. Premium payments can be made from NRE/NRO accounts. Some plans may have restrictions for NRIs residing in certain countries. NRIs should check specific plan terms and FEMA regulations.",
    "source_url": "https://licindia.in/web/guest/customer-service"
  },
  {
    "plan_name": "LIC Term Plan Details",
    "plan_code": "TERM",
    "category": "term_assurance",
    "content": "TERM INSURANCE PLANS: LIC term insurance plans provide pure life protection at affordable premiums. MAXIMUM ENTRY AGE: Maximum entry age for LIC's term insurance plans typically ranges from 60 to 65 years depending on the specific term plan and policy term chosen. MINIMUM SUM ASSURED: Minimum sum assured for term plans varies by plan, typically starting from Rs. 25 lakhs (Rs. 25,00,000) or Rs. 50 lakhs (Rs. 50,00,000). Higher sum assured options up to several crores are available. Term plans do not have any maturity or survival benefits, hence premiums are significantly lower compared to endowment or whole life plans.",
    "source_url": "https://licindia.in/web/guest/term-assurance-plans"
  }
]
